{
  "main": {
    "name": "Ali Kasiri",
    "occupation": "Computer Engineering Student",
    "description": "specializing in AI, computer networks, and Deep Learning, with focus on NLP and Reinforcement Learning. Passionate about developing intelligent algorithms and language-based models",
    "image": "profilepic.jpg",
    "bio": "Final-year Computer Engineering student with strong foundations in Artificial Intelligence, Machine Learning, and Deep Learning, with expertise spanning Natural Language Processing, Reinforcement Learning, Computer Vision, and intelligent security analytics. Experienced in applying AI techniques to diverse domains, including language-based models, image analysis, IoT, and large-scale computing environments, with a growing interest in cybersecurity and autonomous systems. Passionate about developing innovative algorithms and practical solutions at the intersection of AI, advanced computing, and emerging technologies.",
    "contactmessage": "Here is where you write your message to clients.",
    "email": "alikasirii2003@gmail.com",
    "phone": "0991-448-3136",
    "address": {
      "street": "",
      "city": "",
      "state": "",
      "zip": ""
    },
    "website": "http://www.yourwebsite.com",
    "resumedownload": "https://alikasiri1.github.io/portfolio.github.io/Ali Kasiri Resume.pdf",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/ali-kasiri-b451a3249",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/alikasiri1",
        "className": "fa fa-github"
      }
      
    ]
  },
  "resume": {
    "education": [
      {
        "school": "University of Isfahan, Isfahan, Iran ",
        "degree": "B.Sc. in Computer Engineering",
        "graduated": "Sep 2021 – Feb 2026",
        "description": "(GPA: 3.65 / 4)"
      }
    ],
    "work": [
      {
        "company": "Monil-Lan, Isfahan, Iran",
        "title": "Data Science Intern",
        "years": "2024 - 2025",
        "description": "Worked on Large Language Models (LLMs) and Natural Language Processing (NLP) applications. Responsible for data extraction and preprocessing to build a rec-ommendation and Q&A NER system model"
      }
      
    ],
    "skills": [
      {
        "title": "Programming Languages",
        "name": "C, C++, Python"


      },
      {
        "title": "Programming Skills",
        "name": "OOP, Design Patterns, Data Structures & Algorithms, Git"
        
      },
      {
        "title": "Libraries/Frameworks/Tools",
        "name": "Scikit-learn, PyTorch, Pandas, NumPy, Django, Qt, SQL, Linux, Docker"
        
      }
    ] 
  },
  "portfolio": {
    "projects": [
      {
        "title": "Mean shift segmentation",
        "category": "The MeanShiftSegmentation class implements a custom Mean Shift algorithm for image segmentation.",
        "image": "segmented_image.png",
        "url": "https://github.com/alikasiri1/Mean_shift_segmentation"
      },
      {
        "title": "Aesthetic Crop Selection with RLHF", 
        "category": "explores automatic image cropping and composition by combining a pre-trained NIMA model with reinforcement learning from human feedback (RLHF). The system uses NIMA to score candidate crops and then refines its selection policy through human-aligned reinforcement learning, aiming to produce visually appealing images without manual labeling.",
        "image": "episode_visualization.png",
        "url": "https://github.com/alikasiri1/Aesthetic-Crop-Selection-with-RLHF"
      },
      {
        "title": "Retrieval-Augmented Multilingual Generation for Automated Blog and Content Publishing", 
        "category": "An AI-driven web application that allows users to generate, edit, and publish blogs using Large Language Models (LLMs) and image generation models. With just a simple prompt, users can create fully formatted blog posts complete with text, images, and a shareable link.",
        "image": "blog_admin.png",
        "url": "https://github.com/alikasiri1/Blog_Generator_Django_Rest_API"
      },
      {
        "title": "Image processing using cv2", 
        "category": "This project is developed as a part of the Machine Learning Fundamentals course at the University of Isfahan. The main objective is to build a classification and clustering model for leaf images.",
        "image": "leaf.png",
        "url": "https://github.com/alikasiri1/firure_extraction_leaves_classify_and_clustering"
      }
      
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "This is a testimonial text.",
        "user": "Client Name"
      }
    ]
  }
}
